In [2]:
import pandas as pd
import numpy as np

In [3]:
"""1.Write a Pandas program to create a dataframe from a dictionary and display it.
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}"""

sample_data = {
    "X" : [78,85,96,80,86],
    "Y" : [84,94,89,83,86],
    "Z" : [86,97,96,72,83]
}

xyz_data = pd.DataFrame(sample_data)
print(xyz_data)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [129]:
"""2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels:"""
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

data = pd.DataFrame(exam_data,index = labels)
print(data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [11]:
data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [12]:
data[data["score"] > 10]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
j      Jonas   19.0         1     yes

In [13]:
data[data["score"] < 10]

    name  score  attempts qualify
b   Dima    9.0         3      no
e  Emily    9.0         2      no
i  Kevin    8.0         2      no

In [14]:
"""5. Write a Pandas program to select the 'name' and 'score' columns from
 the following DataFrame."""


data[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [13]:
"""6. Write a Pandas program to select the specified columns and rows from a given data frame.
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame."""

data.iloc[[1,3,5,6],[0,1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [17]:
"""7. Write a Pandas program to select the rows where the number of 
attempts in the examination is greater than 2."""


data[data["attempts"] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [20]:
"""8. Write a Pandas program to count the number of rows and columns of a DataFrame.
Sample Python dictionary data and list labels:"""

print(f"Number of rows and columns {data.shape}")

Number of rows and columns (10, 4)

In [29]:
"""8. Write a Pandas program to count the number of rows and columns of a DataFrame.
Sample Python dictionary data and list labels:"""

a = data.axes[0]
b = data.axes[1]

print(f"Number of rows : {len(a)}")
print(f"Number of columns : {len(b)}")

Number of rows : 10
Number of columns : 4

In [6]:
"""9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN."""
data[data["score"].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [45]:
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [7]:
np.where(pd.isnull(data))

(array([3, 7], dtype=int64), array([1, 1], dtype=int64))

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [24]:
"""10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
Sample Python dictionary data and list labels:"""

data[(data["score"] >= 15) and (data["score"] <= 20)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [50]:
data[(data["score"] >= 15) & (data["score"] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [37]:
"""10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
Sample Python dictionary data and list labels:"""

data[data["score"].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [45]:
"""11. Write a Pandas program to select the rows where number 
of attempts in the examination is less than 2 and score greater than 15."""

data[(data["attempts"] < 2) and (data["score"] > 15)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [48]:
"""11. Write a Pandas program to select the rows where number 
of attempts in the examination is less than 2 and score greater than 15.
   | for 'or' & for 'and' """

data[(data["attempts"] < 2) & (data["score"] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [56]:
"""12. Write a Pandas program to change the score in row 'd' to 11.5."""

print("Change the row d score from nan to 11.5")
new_score = data.loc["d","score"] = 11.5
print(new_score)

Change the row d score from nan to 11.5
11.5

In [64]:
"""13. Write a Pandas program to calculate the sum of the examination attempts by the students."""
# Method 1
a = sum(data["attempts"])
# Method 2
b = data.attempts.sum()
print(f"Sum of examination attempts by the Syudents : {b}")

Sum of examination attempts by the Syudents : 19

In [79]:
"""14. Write a Pandas program to calculate the mean of all students' scores.
Data is stored in a dataframe."""
l = []
# working fine in other file but not here â˜º
for i in data.score:
    if type(i) == int:
        l.append(i)

length = len(l)
mean = sum(l)/length
print(mean)

ZeroDivisionError: division by zero

In [75]:
"""14. Write a Pandas program to calculate the mean of all students' scores.
Data is stored in a dataframe."""

a = data["score"].sum()
lenght = len(data["score"])
mean = a/length
print(mean)

inf

C:\Users\solat\AppData\Local\Temp\ipykernel_14020\1693083776.py:6: RuntimeWarning: divide by zero encountered in scalar divide
  mean = a/length

In [78]:
data["score"].mean()

13.333333333333334

In [84]:
data.append({"name":"shaikh","score":15.5,"attempts":1,"qualify":"yes"},index = 'k')

TypeError: DataFrame.append() got an unexpected keyword argument 'index'

In [93]:
# adding a new row into data frame

data.loc["k"] = ["shaikh",15.5,1,"yes"]

In [102]:
print("old data",data)
data.drop("k")

old data         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     shaikh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [112]:
data.sort_values(by = ["score"], ascending = False)

        name  score  attempts qualify
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
k     shaikh   15.5         1     yes
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
d      James   11.5         3      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
i      Kevin    8.0         2      no
h      Laura    NaN         1      no

In [101]:
data.sort_values("name")

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes
k     shaikh   15.5         1     yes

In [114]:
"""
16. Write a Pandas program to sort the DataFrame first by 'name' 
in descending order, then by 'score' in ascending order."""

data.sort_values(by = ["name","score"],ascending = [False,True])

        name  score  attempts qualify
k     shaikh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [131]:
"""17. Write a Pandas program to replace the 'qualify' column contains the 
values 'yes' and 'no' with True and False"""

data.qualify = data["qualify"].map({"yes": True, "no": False})

In [127]:
"""18. Write a Pandas program to change the name 'James' to 'Suresh' in
 name column of the DataFrame."""

data.loc["d"] = {"name":"Suresh"}

In [134]:
data.loc["d","score"] = 11.4

In [136]:
data

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.4         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True